demo-parte1.yaml
config:
  target: "https://rhz5pyquag.execute-api.eu-central-1.amazonaws.com/cloudwalletapimgr-stage"
  http:
    timeout: 120
  phases:
    - duration: 1
      arrivalRate: 1
      maxVusers: 200
      name: test1
  payload:
    path: "demo-parte1.csv"
    order: random
    fields:
      - "SequenceNumberPerPlayer"
scenarios:
  - name: "Search and buy"
    flow:
      - post:
          url: "/cdrcloudwalletwebapi"
          json:
            - id: "aaaaaa90-{{ SequenceNumberPerPlayer }}"
              topic: "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx"
              subject: ""
              data:
                Id: "1$0$Panama-PBS-957ced82-b70a-42da-8402-8ee086b290c7"
                Amount: 5.0
                PreBalance: 440961.09
                PostBalance: 440956.09
                UserId: "5bde8a7e-37a1-e611-9488-000d3a209cae"
                TrxCode: "Panama-PBS-PlaceBet-957ced82-b70a-42da-8402-8ee086b290c7"
                CorrelationId: "19f99e2b-a71d-4eeb-8711-2fbee3233d18"
                Start: "2023-05-03T13:35:02.8488739Z"
                CreatedOn: "2023-05-03T13:35:02.8510526Z"
                Type: 754310000
                Origin: 1
                CasinoSessionId: null
                Attributes:
                  BettingActivityId: "957ced82-b70a-42da-8402-8ee086b290c7"
                  BettingType: "BetPlacement"
                SequenceNumberPerPlayer: 5091
                Region: "Panama"
                RetryCount: 0
              eventType: "otra.cosa"
              eventTime: "2018-01-25T22:12:19.4556811Z"
              metadataVersion: "1"
              dataVersion: "1"